InformationRegisters/IntegrationSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>IntegrationSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ToArchiveTheFile</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UploadData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DownloadData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>GuarantedDelivery</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExchangeRulesName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExchangeDirectory</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Off</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ArchivePassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ConnectionString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RulesStorage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPAdress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPPassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPPassiveConnection</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPPort</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExchangeProtocol</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ExchangeHost</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/IntegrationSettings/Forms/RecordForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	фИмеется = Ложь;
	Если ЗначениеЗаполнено(Record.ExchangeHost) Тогда
		объект = РеквизитФормыВЗначение("Record");
		
		Бинар = объект.RulesStorage.Получить();
		
		Если ТипЗнч(Бинар) = Тип("ДвоичныеДанные") Тогда
			имяВрем = ПолучитьИмяВременногоФайла(".xml");
			Бинар.Записать(имяВрем);
			п28 = Новый Файл(имяВрем);
			Если п28.Существует() Тогда
				фАдрес = ПоместитьВоВременноеХранилище(Бинар,UUID);
				фИмеется = Истина;
				УдалитьФайлы(имяВрем);
			КонецЕсли;
		КонецЕсли; 
	
	КонецЕсли; 
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	Если ЗначениеЗаполнено(фАдрес) И фИмеется Тогда
		CurrentObject.RulesStorage = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(фАдрес));
	КонецЕсли; 
	
EndProcedure

&AtClient
Procedure ЗагрузитьФайлОбмена(Command)
	
	Адрес = "";
	НачИмя = "";
	КонИмя = "";
	ПоместитьФайл(Адрес,НачИмя,КонИмя,Истина,UUID);
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		фАдрес = Адрес;
		фИмеется = Истина;
		ф = Новый Файл(КонИмя);
		Record.ExchangeRulesName = ф.Name;
	КонецЕсли; 
	
EndProcedure

&AtClient
Procedure ВыгрузитьФайлОбмена(Command)
	
	Если ЗначениеЗаполнено(фАдрес) Тогда
		ПолучитьФайл(фАдрес,, Истина);
	Иначе 
		Предупреждение(НСтр("ru='Не существуют файла для сохранения';uz='Kaydetmek için dosya mevcut değil'"));
	КонецЕсли; 
	
EndProcedure

&AtClient
Procedure ConnectionStringOnChange(Item)
	
	Record.ConnectionString = Upper(Record.ConnectionString);
	
EndProcedure

&НаКлиенте
Процедура ExchangeProtocolПриИзменении(Элемент)
	
	ОпределитьСтраницуПоТипуПротокола();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьСтраницуПоТипуПротокола()

	PageName = "PageDirectory";
	
	Если Record.ExchangeProtocol = 1 Тогда
		PageName = "PageFTP";
	КонецЕсли;
	
	Элементы.PagesProtocol.ТекущаяСтраница = Элементы[PageName];

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОпределитьСтраницуПоТипуПротокола();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Record.ExchangeProtocol = 1 Тогда
		
		Если ПустаяСтрока(Record.FTPAdress) Тогда
			Отказ = Истина;
			_СообщениеПользователю("Please set up adress for FTP connection","FTPAdress");
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(Record.FTPPort) Тогда
			Отказ = Истина;
			_СообщениеПользователю("Please set up port for FTP connection","FTPPort");
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(Record.FTPUser) Тогда
			Отказ = Истина;
			_СообщениеПользователю("Please set up user for FTP connection","FTPUser");
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(Record.FTPPassword) Тогда
			Отказ = Истина;
			_СообщениеПользователю("Please set up password for FTP connection","FTPPassword");
		КонецЕсли; 
		
	Иначе 
		
		Если ПустаяСтрока(Record.ExchangeDirectory) Тогда
			Отказ = Истина;
			_СообщениеПользователю("Please set up exchange directory","ExchangeDirectory");
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура _СообщениеПользователю(Текст,Поле)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	
	Если Не ПустаяСтрока(Поле) Тогда
		Сообщение.Поле = Поле;
	КонецЕсли; 
	
	Сообщение.Сообщить(); 
	
КонецПроцедуры // СообщениеПользователю()

&НаСервереБезКонтекста
Процедура ВыполнитьОбменНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ExchangeDataServer.PerformDataSyncronization()
КонецПроцедуры
